#include "CommonDec.h"
#include "MENU.h"
#include "PLAYER.h"
#include "BlackJack.h"

void MENU::ShowIntro()
{
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠    @@@@@@@@@@@     @@                 @@@          @@@@@@@      @@       @@        ♧" << '\n';
	cout << "♤    @@        @@    @@                @@ @@        @@     @@     @@      @@         ♠" << '\n';
	cout << "♣    @@        @@    @@               @@   @@      @@        @@   @@     @@          ♤" << '\n';
	cout << "♧    @@@@@@@@@@@     @@              @@@@@@@@@    @@              @@@@@@@@           ♣" << '\n';
	cout << "♠    @@        @@    @@             @@       @@    @@       @@    @@     @@          ♧" << '\n';
	cout << "♤    @@         @@   @@            @@         @@    @@     @@     @@      @@         ♠" << '\n';
	cout << "♣    @@@@@@@@@@@@@   @@@@@@@@@@@@ @@           @@    @@@@@@@      @@       @@        ♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠                           @@      @@         @@@@@    @@    @@                     ♧" << '\n';
	cout << "♤                           @@     @@ @@      @@   @@   @@   @@                      ♠" << '\n';
	cout << "♣                   @@      @@    @@@@@@@    @@         @@@@@@                       ♤" << '\n';
	cout << "♧                    @@    @@    @@     @@    @@   @@   @@   @@                      ♣" << '\n';
	cout << "♠                     @@@@@@    @@       @@    @@@@@    @@    @@                     ♧" << '\n';
	cout << "♤                                                                                    ♠" << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n' << '\n';

	cout << "                       ★시작하려면 아무키나 누르세요★";
	_getch();

}

void MENU::ShowMenu()
{
	cout << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠    1. 블랙잭 시작하기                                                              ♧" << '\n';
	cout << "♤                                                                                    ♠" << '\n';
	cout << "♣                                                                                    ♤" << '\n';
	cout << "♧    2. 내 지갑 상태                                                                 ♣" << '\n';
	cout << "♠                                                                                    ♧" << '\n';
	cout << "♤                                                                                    ♠" << '\n';
	cout << "♣    3. 블랙잭 설명 듣기                                                             ♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠                                                                                    ♧" << '\n';
	cout << "♤    4. 대출 받기                                                                    ♠" << '\n';
	cout << "♣                                                                                    ♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠    5. 게임 종료                                                                    ♧" << '\n';
	cout << "♤                                                                 made in sehoon     ♠" << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n' << '\n';
	cout << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << "                          선택 : ";
	
}

void MENU::Game(PLAYER& user)
{
	int batting;
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n';
	cout << " 블랙잭 게임을 시작합니다." << '\n' << '\n';
	cout << " 현재 보유 금액 : ";
	user.ShowMoney();
	cout << " 배팅할 금액을 입력하세요 : ";
	cin >> batting;
	cout << '\n' << '\n';

	while (user.GetMoney() < batting) // 금액 부족 시
	{
		cout << " 금액이 부족합니다. 배팅할 금액을 다시 입력해주세요." << '\n';
		cout << " 배팅할 금액을 입력하세요 : ";
		cin >> batting;
	}
	
	cout << ' ' << batting << "원을 배팅하셨습니다." << '\n';
	cout << " 블랙잭 게임을 시작하겠습니다." << '\n' << '\n';
	MainGame(user, batting);
}