#include "CommonDec.h"
#include "MENU.h"
#include "PLAYER.h"
#include "BlackJack.h"

void MENU::ShowIntro()
{
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠    @@@@@@@@@@@     @@                 @@@          @@@@@@@      @@       @@        ♧" << '\n';
	cout << "♤    @@        @@    @@                @@ @@        @@     @@     @@      @@         ♠" << '\n';
	cout << "♣    @@        @@    @@               @@   @@      @@        @@   @@     @@          ♤" << '\n';
	cout << "♧    @@@@@@@@@@@     @@              @@@@@@@@@    @@              @@@@@@@@           ♣" << '\n';
	cout << "♠    @@        @@    @@             @@       @@    @@       @@    @@     @@          ♧" << '\n';
	cout << "♤    @@         @@   @@            @@         @@    @@     @@     @@      @@         ♠" << '\n';
	cout << "♣    @@@@@@@@@@@@@   @@@@@@@@@@@@ @@           @@    @@@@@@@      @@       @@        ♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠                           @@      @@         @@@@@    @@    @@                     ♧" << '\n';
	cout << "♤                           @@     @@ @@      @@   @@   @@   @@                      ♠" << '\n';
	cout << "♣                   @@      @@    @@@@@@@    @@         @@@@@@                       ♤" << '\n';
	cout << "♧                    @@    @@    @@     @@    @@   @@   @@   @@                      ♣" << '\n';
	cout << "♠                     @@@@@@    @@       @@    @@@@@    @@    @@                     ♧" << '\n';
	cout << "♤                                                                                    ♠" << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n' << '\n';

	cout << "                       ★시작하려면 아무키나 누르세요★";
	_getch();

}

void MENU::ShowMenu()
{
	cout << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠    1. 블랙잭 시작하기                                                              ♧" << '\n';
	cout << "♤                                                                                    ♠" << '\n';
	cout << "♣                                                                                    ♤" << '\n';
	cout << "♧    2. 내 지갑 상태                                                                 ♣" << '\n';
	cout << "♠                                                                                    ♧" << '\n';
	cout << "♤                                                                                    ♠" << '\n';
	cout << "♣    3. 블랙잭 설명 듣기                                                             ♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠                                                                                    ♧" << '\n';
	cout << "♤    4. 대출 받기                                                                    ♠" << '\n';
	cout << "♣                                                                                    ♤" << '\n';
	cout << "♧                                                                                    ♣" << '\n';
	cout << "♠    5. 게임 종료                                                                    ♧" << '\n';
	cout << "♤                                                                 made in sehoon     ♠" << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n' << '\n';
	cout << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << "                          선택 : ";
	
}

void MENU::Game(PLAYER& user)
{
	int batting;
	cout << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n';
	cout <<'\n' << '\n' << '\n'<< " 블랙잭 게임을 시작합니다." << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << " 현재 보유 금액 : ";
	user.ShowMoney();
	cout << " 배팅할 금액을 입력하세요 : ";
	cin >> batting;
	cout << '\n' << '\n';

	while (user.GetMoney() < batting) // 금액 부족 시
	{
		cout << " 금액이 부족합니다. 배팅할 금액을 다시 입력해주세요." << '\n';
		cout << " 배팅할 금액을 입력하세요 : ";
		cin >> batting;
	}
	cout << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << ' ' << batting << "원을 배팅하셨습니다." << '\n' << '\n';
	cout << " 블랙잭 게임을 시작하겠습니다." << '\n' << '\n' << '\n';
	cout << "                       ★아무키나 누르세요★" << '\n';
	_getch();
	MainGame(user, batting);
}

void MENU::Wallet(PLAYER& user)
{
	cout << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n';
	cout << '\n' << '\n' << '\n' << " 현재 보유 금액은 : " <<user.GetMoney()<<"원 입니다."<< '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << "                       ★아무키나 누르세요★" << '\n';
	_getch();
	return;
}

void MENU::Rule()
{
	cout << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n';
	cout << " 블랙잭 규칙에 대해 설명하겠습니다." << '\n' << '\n' << '\n';
	cout << " 블랙잭은 카드의 합이 21점 또는 21점에 가장 가까운 사람이 승리하는 게임입니다." << '\n' << '\n';
	cout << " 본 게임에서는 A를 1점으로 계산하며 K·Q·J·10은 10점으로 계산합니다." << '\n' << '\n';
	cout << " 그 밖에 9이하의 카드는 그 숫자대로 점수를 계산합니다." << '\n' << '\n' << '\n' << '\n';
	cout << "              ★게임방법을 들으려면 아무키나 누르세요★" << '\n';
	_getch();
	cout << '\n' << '\n' << '\n' << '\n';
	cout << " 블랙잭 게임 방법을 설명하겠습니다." << '\n' << '\n' << '\n';
	cout << " 카드를 받기전 원하는 금액을 먼저 배팅합니다." << '\n' << '\n';
	cout << " 딜러는 유저 -> 딜러 순서대로 카드를 한장씩 돌립니다." << '\n' << '\n';
	cout << " 딜러의 첫번째 카드를 엎어 놓은 것 이외에 모든 사람이 카드를 공개합니다." << '\n' << '\n';
	cout << " 합계가 21점에 가까워지도록 하기 위해 딜러로부터 카드를 추가로 받을 수 있습니다." << '\n' << '\n';
	cout << " 추가카드는 1장씩 몇장이라도 요구할 수 있습니다." << '\n' << '\n';
	cout << " 카드를 더 받지 않는것이 유리하다고 판단되면 추가하지 않아도 됩니다. " << '\n' << '\n';
	cout << " 유저가 카드를 더 이상 받지 않으면 딜러의 추가 카드 차례압니다." << '\n' << '\n';
	cout << " 딜러의 카드가 16점 이하면 카드를 반드시 한장 1장 추가하고, 17점 이상이면 추가할 수 없습니다." << '\n' << "\n";
	cout << " 딜러의 점수와 비교하여 동점이면 무승부, 딜러보다 높으면 이기고, 낮으면 지게 됩니다." << '\n' << '\n';
	cout << " 21점을 초과한 경우 0점으로 간주되어 누구든 즉시 패배합니다." << '\n' << '\n'<<'\n'<<'\n';
	cout << " 그럼 즐거운 게임 되시길 바랍니다." << '\n' << '\n' << '\n' << '\n';
	cout << "                ★아무키나 누르세요★" << '\n';
	_getch();
	return;
}

void MENU::Bank(PLAYER& user)
{
	int money;
	cout << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n';
	cout << " ★ 세 훈 은 행 ★" << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << " 안녕하세요. 세훈은행 입니다." << '\n' << '\n';
	cout << " 얼마 대출해드릴까요?" << '\n' << '\n' << '\n';
	cout << " 현재 보유 금액 : " << user.GetMoney() << "원" << '\n' << '\n';
	cout << " 대출 금액 : ";
	cin >> money;
	user.Bank(money);
	cout << '\n' << '\n';
	cout << ' ' << money << "원이 대출되었습니다. 이용해주셔서 감사합니다." << '\n' << '\n';
	cout << " 대출 후 보유 금액 : " << user.GetMoney() << "원" << '\n' << '\n' << '\n' << '\n';
	cout << "                       ★아무키나 누르세요★" << '\n';
	_getch();
	return;
}

void MENU::Close()
{
	cout << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n';
	cout << "				이용해주셔서 감사합니다." << '\n' << '\n';
	cout << "				   게임을 종료합니다." << '\n' << '\n';
	cout << "♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤♣♧♠♤" << '\n' << '\n' << '\n' << '\n' << '\n' << '\n';
	return;
}